app/Http/Controllers/AdminController.php

    public function index()
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $usersList = User::orderBy('role_id', 'Asc')->paginate(20);
---
select * from `users` where `users`.`deleted_at` is null order by `role_id` asc limit 20 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null

    public function destroy($id)
    {
        // $users = User::findOrFail($id);
        // $users->delete();

        $user = User::findOrFail($id);
        $user->forms->each->delete();
---
update `users` set `deleted_at` = '2021-11-27 21:37:37', `users`.`updated_at` = '2021-11-27 21:37:37' where `id` = 22