app/Http/Controllers/FormsController.php

select * from `forms` where `forms`.`deleted_at` is null order by `date` desc limit 9 offset 0
select count(*) as aggregate from `forms` where `forms`.`deleted_at` is null
select * from `forms` where `deleted_at` is null
select * from `forms` where `forms`.`deleted_at` is null order by `date` desc limit 8 offset 0
select * from `forms` where `deleted_at` is null and `user_id` = 1
---
    public function index()
    {
        if (!Auth::check()) {
            //$formsList = Forms::orderBy('date', 'desc')->take(9)->get();
            $formsList = Forms::orderBy('date', 'desc')->paginate(9);

            $rowForms = DB::table("forms")->where('deleted_at', NULL)->get();
            $countForms = count($rowForms);
            return view('forms.list', ['formsList' => $formsList, 'countForms' => $countForms]);
        }
        /* ----- Récupère x formulaire ordre du plus récent ----- */
        // $formsList = Forms::orderBy('date', 'desc')->take(8)->get();
        $formsList = Forms::orderBy('date', 'desc')->paginate(8);

        /* ----- Visualiser les formulaires qui sont soft-delete ----- */
        //$formsList = Forms::withTrashed()->get();

        /* ----- Le nombre max de formulaire ----- */
        $rowForms = DB::table("forms")->where('deleted_at', NULL)->get();
        $countForms = count($rowForms);

        /* ----- Le nombre de formulaire de l'utilisateur connecté ----- */
        $userForms = DB::table("forms")->where('deleted_at', NULL)->where('user_id', Auth::id())->get();

insert into `forms` (`title`, `description`, `color`, `progress`, `date`, `formulaire`, `user_id`, `updated_at`, `created_at`) values ('desgfreg', 'rgtrhtrht', '#06ea3f', '81', '2021-12-07T23:33', '\"<div data-tpl=\\"header1\\" data-title=\\"Header 1\\" class=\\"drop-element\\"><label>aaazazazaz</label></div><div data-tpl=\\"header2\\" data-title=\\"Header 2\\" class=\\"drop-element\\"><input class=\\"form-control\\" value=\\"\\" id=\\"changeInput\\" placeholder=\\"sqsqsqsq\\"></div><div data-tpl=\\"header3\\" data-title=\\"Header 3\\" class=\\"drop-element\\"><textarea rows=\\"10\\" cols=\\"30\\"></textarea></div>\"', 1, '2021-12-08 01:28:23', '2021-12-08 01:28:23')
---
    public function store(StoreFormsRequest $request)
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $request->validated();
        $forms = Forms::make($request->input());
        $forms->user()->associate(Auth::id());
        $forms->save();

update `forms` set `date` = '2021-12-08T19:47', `formulaire` = '\"\n                <div data-tpl=\\"header2\\" data-title=\\"Header 2\\" class=\\"drop-element\\"><input class=\\"build-element\\" id=\\"changeInput792a\\" placeholder=\\"CCC\\" value=\\"\\"></div><div data-tpl=\\"header2\\" data-title=\\"Header 2\\" class=\\"drop-element\\"><input class=\\"build-element\\" id=\\"changeInput0d0d\\" placeholder=\\"AA1\\" value=\\"\\"></div><div data-tpl=\\"header2\\" data-title=\\"Header 2\\" class=\\"drop-element\\"><input class=\\"build-element\\" id=\\"changeInput327e\\" placeholder=\\"AA2\\" value=\\"\\"></div>                \"', `forms`.`updated_at` = '2021-12-08 18:52:47' where `id` = 58
---
    public function update(StoreFormsRequest $request, Forms $form)
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $request->validated();
        $form->update($request->input());

update `forms` set `deleted_at` = '2021-12-03 23:33:22', `forms`.`updated_at` = '2021-12-03 23:33:22' where `id` = 16
---
    public function destroy($id)
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $forms = Forms::findOrFail($id);
        $forms->delete();

update `forms` set `deleted_at` = '2021-12-12 00:56:43', `forms`.`updated_at` = '2021-12-12 00:56:43' where `id` = 34
---
    public function storeForm(Request $request)
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $forms = Forms::make($request->input());
        $forms->user()->associate(Auth::id());
        $forms->save();