app/Http/Controllers/GroupeController.php

    public function index(Request $request)
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $formsList = Forms::orderBy('id', 'desc')->where('user_id', Auth::id())->get();
---
select * from `forms` where `user_id` = 1 and `forms`.`deleted_at` is null order by `id` desc

    public function store(/*StoreGroupesRequest*/Request $request)
    {
        if (!Auth::check()) {
            return redirect('login');
        }
        $request->validated();
        $forms = Forms::findOrFail($request->input('form_id'));
        $groupes = Groupe::create($request->input());
        $groupes->form()->associate($forms);
        $groupes->save();
        $groupes->users()->associate(Auth::id());
        $groupes->save();

        // return redirect()->route('forms.show', ['form' => $forms]);
        return redirect()->route('groupes.index')->with('message', 'Votre groupe a été créé avec succès !');
---
select * from `forms` where `id` = '30' and `forms`.`deleted_at` is null
select * from `forms` where `user_id` = 1 and `forms`.`deleted_at` is null order by `id` desc