app/Http/Controllers/RechercheAjaxController.php

    function action(Request $request)
    {
        if ($request->ajax()) {
            $output = '';
            $query = $request->get('query');
            if ($query != '') {
                $recherche = Forms::where('title', 'like', '%' . $query . '%')
                    ->orWhere('message', 'like', '%' . $query . '%')

                    ->orWhere('date', 'like', '%' . $query . '%')
                    ->orderBy('date', 'desc')
                    ->get();

                // $user= $recherche->user()->where('name', 'like', '%' . $query . '%')->get();


            }
            $total_row = $recherche->count();
            if ($total_row > 0) {
                foreach ($recherche as $forms) {
                    $output .= "


    <div class='project-box-wrapper curl-top-left'>
        <div class='project-box' style='background-color: " . $forms->color . "8a;'>
            <div class='project-box-header'>
                <span>" . $forms->user->firstname . "
---
select * from `forms` where (`title` like '%v%' or `message` like '%v%' or `date` like '%v%') and `forms`.`deleted_at` is null order by `date` desc
select * from `users` where `users`.`id` = 1 and `users`.`deleted_at` is null limit 1